Revit 2026 API

# FieldDomainPointsByUVSetGridCoordinates Method

---
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetGridCoordinates(
	ICollection<double> uCoordinates,
	ICollection<double> vCoordinates
)
```
```vb
Public Sub SetGridCoordinates (
	uCoordinates As ICollection(Of Double),
	vCoordinates As ICollection(Of Double)
)
```
```cpp
public:
void SetGridCoordinates(
	ICollection<double>^ uCoordinates,
	ICollection<double>^ vCoordinates
)
```
```fsharp
member SetGridCoordinates :
        uCoordinates : ICollection<float> *
        vCoordinates : ICollection<float> -> unit
```

#### Parameters

uCoordinates ICollectionDouble

vCoordinates ICollectionDouble

#### Reference

FieldDomainPointsByUV Class

Autodesk.Revit.DB.Analysis Namespace